Revit 2026 API

# ViewSheetSettingSave Method

---

Save the changes for the current view sheet set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Save()
```
```vb
Public Function Save As Boolean
```
```cpp
public:
bool Save()
```
```fsharp
member Save : unit -> bool
```

#### Return Value

BooleanFalse if save operation fails, otherwise True.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the current view sheet set is In-Session or the current view sheet set is unchanged. |

#### Reference

ViewSheetSetting Class

Autodesk.Revit.DB Namespace